[
    {
        "id": 1,
        "title": "Project 1",
        "description": "A comprehensive digital transformation for a leading retail brand.",
        "details": "This project involved a complete redesign of the user experience and a migration to a modern microservices architecture. Key results included a 40% increase in mobile conversion rates.",
        "tags": [
            "Next.js",
            "TypeScript",
            "Tailwind CSS",
            "Figma"
        ]
    },
    {
        "id": 2,
        "title": "Project 2",
        "description": "Innovative AI-powered solution for predictive maintenance in manufacturing.",
        "details": "We developed a suite of machine learning models to analyze sensor data in real-time, predicting equipment failure before it happens. This saved the client millions in downtime costs.",
        "tags": [
            "Python",
            "TensorFlow",
            "React",
            "AWS"
        ]
    },
    {
        "id": 3,
        "title": "Project 3",
        "description": "Secure and scalable fintech platform for cross-border payments.",
        "details": "Built with a focus on security and reliability, this platform processes thousands of transactions per second across multiple currencies and jurisdictions.",
        "tags": [
            "Go",
            "Kubernetes",
            "PostgreSQL",
            "React"
        ]
    },
    {
        "id": 4,
        "title": "Project 4",
        "description": "Sleek and intuitive fitness tracking application for iOS and Android.",
        "details": "A cross-platform app that synchronizes health data from wearables and provides personalized workout recommendations based on user performance.",
        "tags": [
            "React Native",
            "Firebase",
            "Redux",
            "HealthKit"
        ]
    },
    {
        "id": 5,
        "title": "Project 5",
        "description": "Data-driven marketing dashboard for real-time campaign analysis.",
        "details": "Integrates with multiple social media and advertising APIs to provide a unified view of marketing spend and performance across all channels.",
        "tags": [
            "Vue.js",
            "D3.js",
            "Express",
            "MongoDB"
        ]
    }
]